; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_6 ?v7 ?v13)
             (pred_9 ?v1 ?v8)
             (pred_5 ?v7 ?v8)
             (pred_11 ?v10 ?v7 )
	     (pred_4 ?v7)
             (pred_10 ?v9)
             (pred_2 ?v1)
             (pred_1 ?v8)
             (pred_12 ?v7)
             (pred_8 ?v1)
             (pred_7 ?v7)
             (pred_3 ))



(:action op_2
:parameters (?v6 ?v5 ?v4 ?v11)
:precondition (and (pred_10 ?v6) (pred_10 ?v5) (pred_2 ?v4) (pred_1 ?v11)
          (pred_6 ?v6 ?v5) (pred_9 ?v4 ?v11)
                   (pred_5 ?v5 ?v11) (pred_4 ?v6) 
                   (pred_12 ?v5) (pred_8 ?v4))
:effect (and  (pred_7 ?v5) (not (pred_12 ?v5))))


(:action op_3
:parameters (?v6 ?v2)
:precondition (and (pred_10 ?v6) (pred_10 ?v2)
               (pred_4 ?v6) (pred_6 ?v6 ?v2) (pred_7 ?v2))
:effect (and (pred_4 ?v2) (not (pred_4 ?v6))))

(:action op_5
:parameters (?v6 ?v4)
:precondition (and (pred_10 ?v6) (pred_2 ?v4) 
                  (pred_4 ?v6) (pred_11 ?v4 ?v6) (pred_3 ))
:effect (and (pred_8 ?v4)
   (not (pred_11 ?v4 ?v6)) (not (pred_3 ))))


(:action op_4
:parameters (?v6 ?v12 ?v3)
:precondition (and (pred_10 ?v6) (pred_2 ?v12) (pred_2 ?v3)
                  (pred_4 ?v6) (pred_8 ?v3) (pred_11 ?v12 ?v6))
:effect (and (pred_8 ?v12) (pred_11 ?v3 ?v6)
        (not (pred_8 ?v3)) (not (pred_11 ?v12 ?v6))))

(:action op_1
:parameters (?v6 ?v4)
:precondition (and (pred_10 ?v6) (pred_2 ?v4) 
                  (pred_4 ?v6) (pred_8 ?v4))
:effect (and (pred_3 ) (pred_11 ?v4 ?v6) (not (pred_8 ?v4)))))

; problem
(define (problem grid-5-5-3-4-4)
    (:domain grid)
    (:objects
    obj_13 obj_11 obj_32 obj_15 obj_22 obj_07 obj_25 obj_27 obj_01 obj_31 obj_24 obj_29 obj_03 obj_10 obj_16 obj_05 obj_18 obj_02 obj_12 obj_30 obj_23 obj_04 obj_21 obj_19 obj_06
    obj_20 obj_09 obj_14
    obj_26 obj_28 obj_17 obj_08
    )

    (:init
       (pred_3)

       (pred_10 obj_13)
       (pred_10 obj_11)
       (pred_10 obj_32)
       (pred_10 obj_15)
       (pred_10 obj_22)
       (pred_10 obj_07)
       (pred_10 obj_25)
       (pred_10 obj_27)
       (pred_10 obj_01)
       (pred_10 obj_31)
       (pred_10 obj_24)
       (pred_10 obj_29)
       (pred_10 obj_03)
       (pred_10 obj_10)
       (pred_10 obj_16)
       (pred_10 obj_05)
       (pred_10 obj_18)
       (pred_10 obj_02)
       (pred_10 obj_12)
       (pred_10 obj_30)
       (pred_10 obj_23)
       (pred_10 obj_04)
       (pred_10 obj_21)
       (pred_10 obj_19)
       (pred_10 obj_06)
       (pred_1 obj_20)
       (pred_1 obj_09)
       (pred_1 obj_14)
       (pred_2 obj_26)
       (pred_2 obj_28)
       (pred_2 obj_17)
       (pred_2 obj_08)

       (pred_6 obj_13 obj_07)
       (pred_6 obj_13 obj_11)
       (pred_6 obj_11 obj_25)
       (pred_6 obj_11 obj_32)
       (pred_6 obj_11 obj_13)
       (pred_6 obj_32 obj_27)
       (pred_6 obj_32 obj_15)
       (pred_6 obj_32 obj_11)
       (pred_6 obj_15 obj_01)
       (pred_6 obj_15 obj_22)
       (pred_6 obj_15 obj_32)
       (pred_6 obj_22 obj_31)
       (pred_6 obj_22 obj_15)
       (pred_6 obj_07 obj_24)
       (pred_6 obj_07 obj_25)
       (pred_6 obj_07 obj_13)
       (pred_6 obj_25 obj_29)
       (pred_6 obj_25 obj_27)
       (pred_6 obj_25 obj_11)
       (pred_6 obj_25 obj_07)
       (pred_6 obj_27 obj_03)
       (pred_6 obj_27 obj_01)
       (pred_6 obj_27 obj_32)
       (pred_6 obj_27 obj_25)
       (pred_6 obj_01 obj_10)
       (pred_6 obj_01 obj_31)
       (pred_6 obj_01 obj_15)
       (pred_6 obj_01 obj_27)
       (pred_6 obj_31 obj_16)
       (pred_6 obj_31 obj_22)
       (pred_6 obj_31 obj_01)
       (pred_6 obj_24 obj_05)
       (pred_6 obj_24 obj_29)
       (pred_6 obj_24 obj_07)
       (pred_6 obj_29 obj_18)
       (pred_6 obj_29 obj_03)
       (pred_6 obj_29 obj_25)
       (pred_6 obj_29 obj_24)
       (pred_6 obj_03 obj_02)
       (pred_6 obj_03 obj_10)
       (pred_6 obj_03 obj_27)
       (pred_6 obj_03 obj_29)
       (pred_6 obj_10 obj_12)
       (pred_6 obj_10 obj_16)
       (pred_6 obj_10 obj_01)
       (pred_6 obj_10 obj_03)
       (pred_6 obj_16 obj_30)
       (pred_6 obj_16 obj_31)
       (pred_6 obj_16 obj_10)
       (pred_6 obj_05 obj_23)
       (pred_6 obj_05 obj_18)
       (pred_6 obj_05 obj_24)
       (pred_6 obj_18 obj_04)
       (pred_6 obj_18 obj_02)
       (pred_6 obj_18 obj_29)
       (pred_6 obj_18 obj_05)
       (pred_6 obj_02 obj_21)
       (pred_6 obj_02 obj_12)
       (pred_6 obj_02 obj_03)
       (pred_6 obj_02 obj_18)
       (pred_6 obj_12 obj_19)
       (pred_6 obj_12 obj_30)
       (pred_6 obj_12 obj_10)
       (pred_6 obj_12 obj_02)
       (pred_6 obj_30 obj_06)
       (pred_6 obj_30 obj_16)
       (pred_6 obj_30 obj_12)
       (pred_6 obj_23 obj_04)
       (pred_6 obj_23 obj_05)
       (pred_6 obj_04 obj_21)
       (pred_6 obj_04 obj_18)
       (pred_6 obj_04 obj_23)
       (pred_6 obj_21 obj_19)
       (pred_6 obj_21 obj_02)
       (pred_6 obj_21 obj_04)
       (pred_6 obj_19 obj_06)
       (pred_6 obj_19 obj_12)
       (pred_6 obj_19 obj_21)
       (pred_6 obj_06 obj_30)
       (pred_6 obj_06 obj_19)
       (pred_12 obj_32)
       (pred_12 obj_11)
       (pred_12 obj_02)
       (pred_12 obj_01)
       (pred_5  obj_32 obj_20)
       (pred_5  obj_11 obj_09)
       (pred_5  obj_02 obj_14)
       (pred_5  obj_01 obj_14)
       (pred_7 obj_13)
       (pred_7 obj_15)
       (pred_7 obj_22)
       (pred_7 obj_07)
       (pred_7 obj_25)
       (pred_7 obj_27)
       (pred_7 obj_31)
       (pred_7 obj_24)
       (pred_7 obj_29)
       (pred_7 obj_03)
       (pred_7 obj_10)
       (pred_7 obj_16)
       (pred_7 obj_05)
       (pred_7 obj_18)
       (pred_7 obj_12)
       (pred_7 obj_30)
       (pred_7 obj_23)
       (pred_7 obj_04)
       (pred_7 obj_21)
       (pred_7 obj_19)
       (pred_7 obj_06)

       (pred_9  obj_26 obj_20)
       (pred_9  obj_28 obj_09)
       (pred_9  obj_17 obj_14)
       (pred_9  obj_08 obj_20)
       (pred_11 obj_26 obj_05)
       (pred_11 obj_28 obj_06)
       (pred_11 obj_17 obj_05)
       (pred_11 obj_08 obj_06)
       (pred_4 obj_27)
    )

    (:goal (and
       (pred_11 obj_26 obj_03)
       (pred_11 obj_28 obj_11)
       (pred_11 obj_08 obj_12)
    ))
(:constraints
  (always (not (pred_4 obj_10)))
)
)

; plan
1. (op_3 obj_27 obj_25)
   deleted: (pred_4 obj_27)
   added: (pred_4 obj_25)
   goals met: 0 of 3
2. (op_3 obj_25 obj_07)
   deleted: (pred_4 obj_25)
   added: (pred_4 obj_07)
   goals met: 0 of 3
3. (op_3 obj_07 obj_24)
   deleted: (pred_4 obj_07)
   added: (pred_4 obj_24)
   goals met: 0 of 3
4. (op_3 obj_24 obj_05)
   deleted: (pred_4 obj_24)
   added: (pred_4 obj_05)
   goals met: 0 of 3
5. (op_5 obj_05 obj_17)
   deleted: (pred_11 obj_17 obj_05) (pred_3)
   added: (pred_8 obj_17)
   goals met: 0 of 3
6. (op_3 obj_05 obj_24)
   deleted: (pred_4 obj_05)
   added: (pred_4 obj_24)
   goals met: 0 of 3
7. (op_1 obj_24 obj_17)
   deleted: (pred_8 obj_17)
   added: (pred_3) (pred_11 obj_17 obj_24)
   goals met: 0 of 3
8. (op_3 obj_24 obj_05)
   deleted: (pred_4 obj_24)
   added: (pred_4 obj_05)
   goals met: 0 of 3
9. (op_5 obj_05 obj_26)
   deleted: (pred_11 obj_26 obj_05) (pred_3)
   added: (pred_8 obj_26)
   goals met: 0 of 3
10. (op_3 obj_05 obj_24)
   deleted: (pred_4 obj_05)
   added: (pred_4 obj_24)
   goals met: 0 of 3
11. (op_3 obj_24 obj_29)
   deleted: (pred_4 obj_24)
   added: (pred_4 obj_29)
   goals met: 0 of 3
12. (op_3 obj_29 obj_03)
   deleted: (pred_4 obj_29)
   added: (pred_4 obj_03)
   goals met: 0 of 3
13. (op_1 obj_03 obj_26)
   deleted: (pred_8 obj_26)
   added: (pred_3) (pred_11 obj_26 obj_03)
   goals met: 1 of 3
14. (op_3 obj_03 obj_29)
   deleted: (pred_4 obj_03)
   added: (pred_4 obj_29)
   goals met: 1 of 3
15. (op_3 obj_29 obj_18)
   deleted: (pred_4 obj_29)
   added: (pred_4 obj_18)
   goals met: 1 of 3
16. (op_3 obj_18 obj_04)
   deleted: (pred_4 obj_18)
   added: (pred_4 obj_04)
   goals met: 1 of 3
17. (op_3 obj_04 obj_21)
   deleted: (pred_4 obj_04)
   added: (pred_4 obj_21)
   goals met: 1 of 3
18. (op_3 obj_21 obj_19)
   deleted: (pred_4 obj_21)
   added: (pred_4 obj_19)
   goals met: 1 of 3
19. (op_3 obj_19 obj_06)
   deleted: (pred_4 obj_19)
   added: (pred_4 obj_06)
   goals met: 1 of 3
20. (op_5 obj_06 obj_08)
   deleted: (pred_11 obj_08 obj_06) (pred_3)
   added: (pred_8 obj_08)
   goals met: 1 of 3
21. (op_3 obj_06 obj_19)
   deleted: (pred_4 obj_06)
   added: (pred_4 obj_19)
   goals met: 1 of 3
22. (op_3 obj_19 obj_12)
   deleted: (pred_4 obj_19)
   added: (pred_4 obj_12)
   goals met: 1 of 3
23. (op_1 obj_12 obj_08)
   deleted: (pred_8 obj_08)
   added: (pred_3) (pred_11 obj_08 obj_12)
   goals met: 2 of 3
24. (op_3 obj_12 obj_19)
   deleted: (pred_4 obj_12)
   added: (pred_4 obj_19)
   goals met: 2 of 3
25. (op_3 obj_19 obj_21)
   deleted: (pred_4 obj_19)
   added: (pred_4 obj_21)
   goals met: 2 of 3
26. (op_3 obj_21 obj_04)
   deleted: (pred_4 obj_21)
   added: (pred_4 obj_04)
   goals met: 2 of 3
27. (op_3 obj_04 obj_18)
   deleted: (pred_4 obj_04)
   added: (pred_4 obj_18)
   goals met: 2 of 3
28. (op_3 obj_18 obj_29)
   deleted: (pred_4 obj_18)
   added: (pred_4 obj_29)
   goals met: 2 of 3
29. (op_3 obj_29 obj_03)
   deleted: (pred_4 obj_29)
   added: (pred_4 obj_03)
   goals met: 2 of 3
30. (op_5 obj_03 obj_26)
   deleted: (pred_11 obj_26 obj_03) (pred_3)
   added: (pred_8 obj_26)
   goals met: 1 of 3
31. (op_3 obj_03 obj_27)
   deleted: (pred_4 obj_03)
   added: (pred_4 obj_27)
   goals met: 1 of 3
32. (op_2 obj_27 obj_32 obj_26 obj_20)
   deleted: (pred_12 obj_32)
   added: (pred_7 obj_32)
   goals met: 1 of 3
33. (op_3 obj_27 obj_03)
   deleted: (pred_4 obj_27)
   added: (pred_4 obj_03)
   goals met: 1 of 3
34. (op_1 obj_03 obj_26)
   deleted: (pred_8 obj_26)
   added: (pred_3) (pred_11 obj_26 obj_03)
   goals met: 2 of 3
35. (op_3 obj_03 obj_29)
   deleted: (pred_4 obj_03)
   added: (pred_4 obj_29)
   goals met: 2 of 3
36. (op_3 obj_29 obj_18)
   deleted: (pred_4 obj_29)
   added: (pred_4 obj_18)
   goals met: 2 of 3
37. (op_3 obj_18 obj_04)
   deleted: (pred_4 obj_18)
   added: (pred_4 obj_04)
   goals met: 2 of 3
38. (op_3 obj_04 obj_21)
   deleted: (pred_4 obj_04)
   added: (pred_4 obj_21)
   goals met: 2 of 3
39. (op_3 obj_21 obj_19)
   deleted: (pred_4 obj_21)
   added: (pred_4 obj_19)
   goals met: 2 of 3
40. (op_3 obj_19 obj_06)
   deleted: (pred_4 obj_19)
   added: (pred_4 obj_06)
   goals met: 2 of 3
41. (op_5 obj_06 obj_28)
   deleted: (pred_11 obj_28 obj_06) (pred_3)
   added: (pred_8 obj_28)
   goals met: 2 of 3
42. (op_3 obj_06 obj_30)
   deleted: (pred_4 obj_06)
   added: (pred_4 obj_30)
   goals met: 2 of 3
43. (op_3 obj_30 obj_16)
   deleted: (pred_4 obj_30)
   added: (pred_4 obj_16)
   goals met: 2 of 3
44. (op_3 obj_16 obj_31)
   deleted: (pred_4 obj_16)
   added: (pred_4 obj_31)
   goals met: 2 of 3
45. (op_3 obj_31 obj_22)
   deleted: (pred_4 obj_31)
   added: (pred_4 obj_22)
   goals met: 2 of 3
46. (op_3 obj_22 obj_15)
   deleted: (pred_4 obj_22)
   added: (pred_4 obj_15)
   goals met: 2 of 3
47. (op_3 obj_15 obj_32)
   deleted: (pred_4 obj_15)
   added: (pred_4 obj_32)
   goals met: 2 of 3
48. (op_2 obj_32 obj_11 obj_28 obj_09)
   deleted: (pred_12 obj_11)
   added: (pred_7 obj_11)
   goals met: 2 of 3
49. (op_3 obj_32 obj_11)
   deleted: (pred_4 obj_32)
   added: (pred_4 obj_11)
   goals met: 2 of 3
50. (op_1 obj_11 obj_28)
   deleted: (pred_8 obj_28)
   added: (pred_3) (pred_11 obj_28 obj_11)
   goals met: 3 of 3
